read_verilog -sv ../MODEL/exe_unit_w1.sv
read_verilog -sv ../MODEL/otherModules.sv

copy ../MODEL/exe_unit_w1 ../MODEL/exe_unit_w1_rtl

hierarchy -top ../MODEL/exe_unit_w1_rtl

synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr ../MODEL/exe_unit_w1_rtl.sv
    
stat -tech cmos